'''
Задача 32: Определить индексы элементов массива (списка), значения которых
принадлежат заданному диапазону (т.е. не меньше заданного минимума
и не больше заданного максимума)

Ввод: [-5, 9, 0, 3, -1, -2, 1, 4, -2, 10, 2, 0, -9, 8, 10, -9, 0, -5, -5, 7]

Вывод: [1, 9, 13, 14, 19]

'''
list1 = [-5, 9, 0, 3, -1, -2, 1, 4, -2, 10, 2, 0, -9, 8, 10, -9, 0, -5, -5, 7]


def range_index(list1):
    min = -5
    max = 2
    res_list = []
    for i in list1:
        if min < i < max:
            indx = list1.index(i)
            if indx not in res_list:
                res_list.append(indx)
    return res_list


print(range_index(list1))
